0wQ/ch32x035-usb-wchlink/src/wchlink/rvswd/rvswd_flash.c
#include "rvswd_flash.h"

#include "bsp/bsp_delay.h"
#include "rvswd_debug.h"
#include "rvswd_dmi.h"
#include "rvswd_memory.h"
#include "rvswd_reset.h"
#include "rvswd_types.h"

#include <stddef.h>

#include <ch32x035.h>

#define RVSWD_DMI_CONTROL      0x10u
#define RVSWD_DMI_CONFIG       0x7du
#define RVSWD_DMI_SHADOW       0x7eu
#define RVSWD_DMI_CHIP_ID      0x7fu
#define RVSWD_DMI_HARTINFO     0x12u
#define RVSWD_DMI_DATA0        0x04u
#define RVSWD_DMI_DATA1        0x05u
#define RVSWD_DMI_ABSTRACTCS   0x16u
#define RVSWD_DMI_COMMAND      0x17u
#define RVSWD_DMI_ABSTRACTAUTO 0x18u
#define RVSWD_DMI_PROGBUF0     0x20u
#define RVSWD_DMI_PROGBUF1     0x21u
#define RVSWD_DMI_PROGBUF2     0x22u

#define RVSWD_STATUS_OK           1u
#define RVSWD_STATUS_BUSY         3u
#define RVSWD_LONG_STATUS_OK      0u
#define RVSWD_LONG_STATUS_BUSY    3u
#define RVSWD_INTERFRAME_GUARD_US 0u

#define RVSWD_DMI_WRITE_RETRY_COUNT     16u
#define RVSWD_DMI_READ_RETRY_COUNT      64u
#define RVSWD_MEMORY_READ_RETRY_COUNT   3u
#define RVSWD_DMI_BUSY_DELAY_US         100u
#define RVSWD_DMI_ERROR_DELAY_US        50u
#define RVSWD_ABSTRACT_COMMAND_DELAY_US 100u
#define RVSWD_ABSTRACT_TIMEOUT_US       10000u
#define RVSWD_RESUME_MIN_DELAY_US       1000u
#define RVSWD_EXECUTE_TIMEOUT_MS        5000u
#define RVSWD_DEBUG_UNLOCK              0x5aa50400u
#define RVSWD_ABSTRACT_COMMAND_EXECUTE  0x00240000u
#define RVSWD_ABSTRACTAUTO_DATA0        0x00000001u
#define RVSWD_DEBUG_DATA_ADDRESS_BASE   0xe0000000u

#define RVSWD_CH5XX_CHIP_ID_ADDRESS 0x40001041u
#define RVSWD_CH5XX_CHIP_ID_CH591   0x91u
#define RVSWD_CH5XX_CHIP_ID_CH592   0x92u
#define RVSWD_CH5XX_CHIP_ID_CH582   0x82u
#define RVSWD_CH5XX_CHIP_ID_CH583   0x83u

#define RVSWD_CH5XX_FLASH_KEY_ADDRESS       0x40001040u
#define RVSWD_CH5XX_FLASH_WORD_DATA_ADDRESS 0x40001800u
#define RVSWD_CH5XX_FLASH_BYTE_DATA_ADDRESS 0x40001804u
#define RVSWD_CH5XX_FLASH_CONTROL_ADDRESS   0x40001806u
#define RVSWD_CH5XX_DEBUG_DATA_ADDRESS      0xe0000380u
#define RVSWD_CH5XX_FLASH_END               0x00078000u
#define RVSWD_CH5XX_FLASH_PAGE_SIZE         0x00000100u
#define RVSWD_CH5XX_FLASH_BLOCK_4K          0x00001000u
#define RVSWD_CH5XX_FLASH_STATUS_RETRIES    102u
#define RVSWD_CH5XX_PAGE_PROGRAM_TIMEOUT_US 100000u
#define RVSWD_CH5XX_ERASE_STUB_ADDRESS      0x20004000u
#define RVSWD_CH5XX_ERASE_STUB_STACK_TOP    0x20007000u
#define RVSWD_CH5XX_ERASE_STUB_MAX_SIZE     512u

#define RVSWD_FLASH_ERROR_CH5XX_COMMAND_BEGIN          0xc2u
#define RVSWD_FLASH_ERROR_CH5XX_COMMAND_ADDRESS        0xc3u
#define RVSWD_FLASH_ERROR_CH5XX_COMMAND_FINISH         0xc4u
#define RVSWD_FLASH_ERROR_CH5XX_STATUS_BEGIN           0xc5u
#define RVSWD_FLASH_ERROR_CH5XX_STATUS_READ_FIRST      0xc6u
#define RVSWD_FLASH_ERROR_CH5XX_STATUS_READ_SECOND     0xc7u
#define RVSWD_FLASH_ERROR_CH5XX_STATUS_FINISH          0xc8u
#define RVSWD_FLASH_ERROR_CH5XX_STATUS_TIMEOUT         0xc9u
#define RVSWD_FLASH_ERROR_CH5XX_PAGE_UNALIGNED         0xcau
#define RVSWD_FLASH_ERROR_CH5XX_PAGE_ERASE_CODE_MODE   0xcbu
#define RVSWD_FLASH_ERROR_CH5XX_PAGE_ERASE_OPEN        0xccu
#define RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_CODE_MODE 0xcdu
#define RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_OPEN      0xceu
#define RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_BEGIN     0xd0u
#define RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_SETUP     0xd1u
#define RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_DATA      0xd2u
#define RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_EXECUTE   0xd3u
#define RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_WAIT      0xd4u
#define RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_STATUS    0xd5u

#define RVSWD_FLASH_KEYR_ADDRESS     0x40022004u
#define RVSWD_FLASH_OBKEYR_ADDRESS   0x40022008u
#define RVSWD_FLASH_STATR_ADDRESS    0x4002200cu
#define RVSWD_FLASH_CTLR_ADDRESS     0x40022010u
#define RVSWD_FLASH_ADDR_ADDRESS     0x40022014u
#define RVSWD_FLASH_OBR_ADDRESS      0x4002201cu
#define RVSWD_FLASH_WPR_ADDRESS      0x40022020u
#define RVSWD_FLASH_MODEKEYR_ADDRESS 0x40022024u
#define RVSWD_OPTION_BYTES_ADDRESS   0x1ffff800u

#define RVSWD_FLASH_KEY1 0x45670123u
#define RVSWD_FLASH_KEY2 0xcdef89abu

#define RVSWD_FLASH_STATR_BUSY          (1u << 0u)
#define RVSWD_FLASH_STATR_WRPRTERR      (1u << 4u)
#define RVSWD_FLASH_STATR_EOP           (1u << 5u)
#define RVSWD_FLASH_CTLR_MER            (1u << 2u)
#define RVSWD_FLASH_CTLR_OPTION_PROGRAM (1u << 4u)
#define RVSWD_FLASH_CTLR_OPTER          (1u << 5u)
#define RVSWD_FLASH_CTLR_STRT           (1u << 6u)
#define RVSWD_FLASH_CTLR_LOCK           (1u << 7u)
#define RVSWD_FLASH_CTLR_OPTION_WRITE   (1u << 9u)
#define RVSWD_FLASH_CTLR_FAST_LOCK      (1u << 15u)
#define RVSWD_FLASH_CTLR_FAST_PROGRAM   (1u << 16u)
#define RVSWD_FLASH_CTLR_BUFFER_LOAD    (1u << 18u)
#define RVSWD_FLASH_CTLR_BUFFER_RESET   (1u << 19u)
#define RVSWD_FLASH_OBR_READ_PROTECTED  (1u << 1u)
#define RVSWD_OPTION_BYTES_WORD_COUNT   4u
#define RVSWD_OPTION_RDP_PROTECTED      0x00ffu
#define RVSWD_OPTION_RDP_UNPROTECTED    0x5aa5u
#define RVSWD_FLASH_ERASE_TIMEOUT_US    6000000u

static uint32_t rvswd_flash_last_error_value;

extern const uint8_t ch5xx_flash_erase_stub_start[];
extern const uint8_t ch5xx_flash_erase_stub_end[];

enum rvswd_ch5xx_byte_access_mode {
    RVSWD_CH5XX_BYTE_ACCESS_NONE,
    RVSWD_CH5XX_BYTE_ACCESS_READ,
    RVSWD_CH5XX_BYTE_ACCESS_WRITE,
};

struct rvswd_ch5xx_byte_access {
    enum rvswd_ch5xx_byte_access_mode mode;
};

static bool rvswd_flash_ch5xx_prepare_byte_access(
    struct rvswd_ch5xx_byte_access *access,
    enum rvswd_ch5xx_byte_access_mode mode) {
    uint32_t load_instruction;
    uint32_t store_instruction;

    if (access->mode == mode) {
        return true;
    }

    if (mode == RVSWD_CH5XX_BYTE_ACCESS_READ) {
        load_instruction = 0x00058483u;
        store_instruction = 0x00968223u;
    } else if (mode == RVSWD_CH5XX_BYTE_ACCESS_WRITE) {
        load_instruction = 0x00468483u;
        store_instruction = 0x00958023u;
    } else {
        return false;
    }

    // 全擦期间连续访问 Flash 命令口，切换读写方向时才重建 Program Buffer
    if (!rvswd_debug_write_raw_gpr(13u, RVSWD_CH5XX_DEBUG_DATA_ADDRESS) ||
        !rvswd_dmi_write(0x16u, 0x00000700u) ||
        !rvswd_dmi_write(0x20u, load_instruction) ||
        !rvswd_dmi_write(0x21u, store_instruction) ||
        !rvswd_dmi_write(0x22u, 0x00100073u)) {
        access->mode = RVSWD_CH5XX_BYTE_ACCESS_NONE;
        return false;
    }

    access->mode = mode;
    return true;
}

static bool rvswd_flash_ch5xx_erase_write8(struct rvswd_ch5xx_byte_access *access,
                                           uint32_t address, uint8_t value) {
    uint32_t abstractcs;

    if (!rvswd_flash_ch5xx_prepare_byte_access(access, RVSWD_CH5XX_BYTE_ACCESS_WRITE) ||
        !rvswd_dmi_write(0x05u, value) ||
        !rvswd_dmi_write(0x04u, address) ||
        !rvswd_dmi_write(0x17u, 0x0027100bu) ||
        !rvswd_debug_wait_abstract_idle(&abstractcs)) {
        return false;
    }

    return ((abstractcs >> 8u) & 0x07u) == 0u;
}

