0wQ/ch32x035-usb-wchlink/src/wchlink/rvswd/rvswd_flash.c
static bool rvswd_flash_ch5xx_erase_read8(struct rvswd_ch5xx_byte_access *access,
                                          uint32_t address, uint8_t *value) {
    uint32_t abstractcs;
    uint32_t data;

    if (value == NULL ||
        !rvswd_flash_ch5xx_prepare_byte_access(access, RVSWD_CH5XX_BYTE_ACCESS_READ) ||
        !rvswd_dmi_write(0x04u, address) ||
        !rvswd_dmi_write(0x17u, 0x0027100bu) ||
        !rvswd_debug_wait_abstract_idle(&abstractcs) ||
        ((abstractcs >> 8u) & 0x07u) != 0u ||
        !rvswd_dmi_read(0x05u, &data)) {
        return false;
    }

    *value = (uint8_t)data;
    return true;
}

static bool rvswd_memory_write16(uint32_t address, uint16_t value,
                                 uint32_t timeout_us) {
    uint32_t abstractcs;

    // 使用 x8 保存数据，x9 保存目标地址，Program Buffer 执行 sh
    if (!rvswd_dmi_write(0x18u, 0u) ||
        !rvswd_dmi_write(0x16u, 0x00000700u) ||
        !rvswd_dmi_write(0x20u, 0x00849023u) ||
        !rvswd_dmi_write(0x21u, 0x00100073u) ||
        !rvswd_dmi_write(0x04u, address) ||
        !rvswd_dmi_write(0x17u, 0x00231009u) ||
        !rvswd_debug_wait_abstract_idle(&abstractcs) ||
        ((abstractcs >> 8u) & 0x07u) != 0u ||
        !rvswd_dmi_write(0x04u, value) ||
        !rvswd_dmi_write(0x17u, 0x00271008u) ||
        !rvswd_debug_wait_abstract_idle_timeout(&abstractcs, timeout_us)) {
        return false;
    }

    return ((abstractcs >> 8u) & 0x07u) == 0u;
}

static bool rvswd_flash_wait_ready(const struct rvswd_target_profile *profile,
                                   uint32_t *status, uint8_t read_error,
                                   uint8_t timeout_error) {
    uint64_t start = bsp_time_us();

    do {
        if (!rvswd_memory_read32(profile, true, RVSWD_FLASH_STATR_ADDRESS,
                                 status)) {
            rvswd_flash_last_error_value = read_error;
            return false;
        }
        if ((*status & RVSWD_FLASH_STATR_BUSY) == 0u) {
            return true;
        }
        bsp_delay_us(100u);
    } while ((bsp_time_us() - start) < RVSWD_FLASH_ERASE_TIMEOUT_US);

    rvswd_flash_last_error_value = timeout_error;
    return false;
}

static bool rvswd_flash_unlock_main_option_and_fast(uint32_t control) {
    if ((control & (RVSWD_FLASH_CTLR_LOCK | RVSWD_FLASH_CTLR_FAST_LOCK)) == 0u) {
        return true;
    }

    // L103 需要同时解锁主存储区、用户字和快速编程模式
    return rvswd_memory_write32(RVSWD_FLASH_KEYR_ADDRESS, RVSWD_FLASH_KEY1) &&
           rvswd_memory_write32(RVSWD_FLASH_KEYR_ADDRESS, RVSWD_FLASH_KEY2) &&
           rvswd_memory_write32(RVSWD_FLASH_OBKEYR_ADDRESS, RVSWD_FLASH_KEY1) &&
           rvswd_memory_write32(RVSWD_FLASH_OBKEYR_ADDRESS, RVSWD_FLASH_KEY2) &&
           rvswd_memory_write32(RVSWD_FLASH_MODEKEYR_ADDRESS, RVSWD_FLASH_KEY1) &&
           rvswd_memory_write32(RVSWD_FLASH_MODEKEYR_ADDRESS, RVSWD_FLASH_KEY2);
}

static bool rvswd_flash_unlock_main_and_fast(uint32_t control) {
    if ((control & RVSWD_FLASH_CTLR_LOCK) != 0u &&
        (!rvswd_memory_write32(RVSWD_FLASH_KEYR_ADDRESS, RVSWD_FLASH_KEY1) ||
         !rvswd_memory_write32(RVSWD_FLASH_KEYR_ADDRESS, RVSWD_FLASH_KEY2))) {
        return false;
    }
    if ((control & RVSWD_FLASH_CTLR_FAST_LOCK) != 0u &&
        (!rvswd_memory_write32(RVSWD_FLASH_MODEKEYR_ADDRESS, RVSWD_FLASH_KEY1) ||
         !rvswd_memory_write32(RVSWD_FLASH_MODEKEYR_ADDRESS, RVSWD_FLASH_KEY2))) {
        return false;
    }
    return true;
}

static bool rvswd_flash_ch5xx_flash_issue(struct rvswd_ch5xx_byte_access *access,
                                          uint8_t command) {
    return rvswd_flash_ch5xx_erase_write8(access, RVSWD_CH5XX_FLASH_CONTROL_ADDRESS, 0u) &&
           rvswd_flash_ch5xx_erase_write8(access, RVSWD_CH5XX_FLASH_CONTROL_ADDRESS, 5u) &&
           rvswd_flash_ch5xx_erase_write8(access, RVSWD_CH5XX_FLASH_BYTE_DATA_ADDRESS,
                                          command);
}

static bool rvswd_flash_ch5xx_flash_wait_control_ready(
    struct rvswd_ch5xx_byte_access *access) {
    for (uint32_t retry = 0u; retry < RVSWD_CH5XX_FLASH_STATUS_RETRIES; ++retry) {
        uint8_t control;

        if (!rvswd_flash_ch5xx_erase_read8(access, RVSWD_CH5XX_FLASH_CONTROL_ADDRESS,
                                           &control)) {
            return false;
        }
        if ((control & 0x80u) == 0u) {
            return true;
        }
    }
    return false;
}

static bool rvswd_flash_ch5xx_flash_end(struct rvswd_ch5xx_byte_access *access) {
    return rvswd_flash_ch5xx_flash_wait_control_ready(access) &&
           rvswd_flash_ch5xx_erase_write8(access, RVSWD_CH5XX_FLASH_CONTROL_ADDRESS, 0u);
}

static bool rvswd_flash_ch5xx_flash_out(struct rvswd_ch5xx_byte_access *access,
                                        uint8_t value) {
    return rvswd_flash_ch5xx_flash_wait_control_ready(access) &&
           rvswd_flash_ch5xx_erase_write8(access, RVSWD_CH5XX_FLASH_BYTE_DATA_ADDRESS,
                                          value);
}

static bool rvswd_flash_ch5xx_flash_in(struct rvswd_ch5xx_byte_access *access,
                                       uint8_t *value) {
    return rvswd_flash_ch5xx_flash_wait_control_ready(access) &&
           rvswd_flash_ch5xx_erase_read8(access, RVSWD_CH5XX_FLASH_BYTE_DATA_ADDRESS,
                                         value);
}

static bool rvswd_flash_ch5xx_flash_begin(struct rvswd_ch5xx_byte_access *access,
                                          uint8_t command) {
    // CH5xx 每次切换命令前先完成命令 6，命令口状态不能跨命令复用
    return rvswd_flash_ch5xx_flash_issue(access, 6u) &&
           rvswd_flash_ch5xx_flash_end(access) &&
           rvswd_flash_ch5xx_flash_issue(access, command);
}

static bool rvswd_flash_ch5xx_flash_open(struct rvswd_ch5xx_byte_access *access) {
    // FlashOpen 先使能命令口，再完成 0xff 初始化命令，擦页和写页均从此状态开始
    return rvswd_flash_ch5xx_erase_write8(access, RVSWD_CH5XX_FLASH_CONTROL_ADDRESS, 4u) &&
           rvswd_flash_ch5xx_flash_begin(access, 0xffu) &&
           rvswd_flash_ch5xx_flash_end(access);
}

static bool rvswd_flash_ch5xx_flash_enable_code_mode(void) {
    uint32_t abstractcs;

