0wQ/ch32x035-usb-wchlink/src/wchlink/rvswd/rvswd_flash.c
    // SAFE_ACCESS_SIG 必须在修改 ROM 配置后清零，避免命令口继承未完成的安全访问状态
    if (!rvswd_debug_write_raw_gpr(13u, RVSWD_CH5XX_FLASH_KEY_ADDRESS) ||
        !rvswd_debug_write_raw_gpr(10u, 0x57u) ||
        !rvswd_debug_write_raw_gpr(11u, 0xa8u) ||
        !rvswd_debug_write_raw_gpr(12u, 0xe0u) ||
        !rvswd_dmi_write(0x18u, 0u) ||
        !rvswd_dmi_write(0x16u, 0x00000700u) ||
        !rvswd_dmi_write(0x20u, 0x00a68023u) ||
        !rvswd_dmi_write(0x21u, 0x00b68023u) ||
        !rvswd_dmi_write(0x22u, 0x00010001u) ||
        !rvswd_dmi_write(0x23u, 0x00c68223u) ||
        !rvswd_dmi_write(0x24u, 0x00068023u) ||
        !rvswd_dmi_write(0x25u, 0x00100073u) ||
        !rvswd_dmi_write(0x17u, 0x00271000u) ||
        !rvswd_debug_wait_abstract_idle(&abstractcs)) {
        return false;
    }

    return ((abstractcs >> 8u) & 0x07u) == 0u;
}

static bool rvswd_flash_ch5xx_flash_write_address(struct rvswd_ch5xx_byte_access *access,
                                                  uint32_t address) {
    return rvswd_flash_ch5xx_flash_out(access, (uint8_t)(address >> 16u)) &&
           rvswd_flash_ch5xx_flash_out(access, (uint8_t)(address >> 8u)) &&
           rvswd_flash_ch5xx_flash_out(access, (uint8_t)address);
}

static bool rvswd_flash_ch5xx_flash_wait_ready(struct rvswd_ch5xx_byte_access *access) {
    if (!rvswd_flash_ch5xx_flash_end(access)) {
        rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_COMMAND_FINISH;
        return false;
    }

    for (uint32_t retry = 0u; retry < RVSWD_CH5XX_FLASH_STATUS_RETRIES; ++retry) {
        uint8_t status;

        // LinkE 连续读取两次状态，第二次读数用于判断命令是否仍在执行
        if (!rvswd_flash_ch5xx_flash_begin(access, 5u)) {
            rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_STATUS_BEGIN;
            return false;
        }
        if (!rvswd_flash_ch5xx_flash_in(access, &status)) {
            rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_STATUS_READ_FIRST;
            return false;
        }
        if (!rvswd_flash_ch5xx_flash_in(access, &status)) {
            rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_STATUS_READ_SECOND;
            return false;
        }
        if (!rvswd_flash_ch5xx_flash_end(access)) {
            rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_STATUS_FINISH;
            return false;
        }
        if ((status & 1u) == 0u) {
            return true;
        }
    }
    rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_STATUS_TIMEOUT;
    return false;
}

static bool rvswd_flash_ch5xx_flash_erase_command(
    struct rvswd_ch5xx_byte_access *access, uint32_t address, uint8_t command) {
    if (!rvswd_flash_ch5xx_flash_begin(access, command)) {
        rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_COMMAND_BEGIN;
        return false;
    }
    if (!rvswd_flash_ch5xx_flash_write_address(access, address)) {
        rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_COMMAND_ADDRESS;
        return false;
    }
    if (!rvswd_flash_ch5xx_flash_wait_ready(access)) {
        return false;
    }
    return true;
}

static bool rvswd_flash_ch5xx_flash_program_page(
    struct rvswd_ch5xx_byte_access *access, const uint8_t *data) {
    uint32_t abstractcs;

    // 官方 0x33D4 与 CH5xx 参考实现都使用该 Program Buffer，将 a4 的字写入 Flash 数据口
    access->mode = RVSWD_CH5XX_BYTE_ACCESS_NONE;
    if (!rvswd_debug_write_raw_gpr(13u, RVSWD_CH5XX_FLASH_WORD_DATA_ADDRESS) ||
        !rvswd_debug_write_raw_gpr(5u, 21u) ||
        !rvswd_dmi_write(0x18u, 0u) ||
        !rvswd_dmi_write(0x16u, 0x00000700u) ||
        !rvswd_dmi_write(0x20u, 0x4791c298u) ||
        !rvswd_dmi_write(0x21u, 0x00668703u) ||
        !rvswd_dmi_write(0x22u, 0xfe074ee3u) ||
        !rvswd_dmi_write(0x23u, 0x00568323u) ||
        !rvswd_dmi_write(0x24u, 0xfbed17fdu) ||
        !rvswd_dmi_write(0x25u, 0x00100073u)) {
        rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_SETUP;
        return false;
    }

    for (uint32_t offset = 0u; offset < RVSWD_CH5XX_FLASH_PAGE_SIZE; offset += 4u) {
        uint32_t value = (uint32_t)data[offset + 0u] |
                         ((uint32_t)data[offset + 1u] << 8u) |
                         ((uint32_t)data[offset + 2u] << 16u) |
                         ((uint32_t)data[offset + 3u] << 24u);

        if (!rvswd_dmi_write(0x04u, value)) {
            rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_DATA;
            return false;
        }
        // 该 Abstract Command 同时把 data0 传入 a4 并执行 Program Buffer
        if (!rvswd_dmi_write(0x17u, 0x0027100eu)) {
            rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_EXECUTE;
            return false;
        }
        // 目标执行真实 Flash 写入时 busy 可长于普通内存访问，单字仍受 100 ms 上限约束
        if (!rvswd_debug_wait_abstract_idle_timeout(
                &abstractcs, RVSWD_CH5XX_PAGE_PROGRAM_TIMEOUT_US)) {
            rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_WAIT;
            return false;
        }
        if (((abstractcs >> 8u) & 0x07u) != 0u) {
            rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_STATUS;
            return false;
        }
    }
    return true;
}

bool rvswd_flash_rewrite_page(const struct rvswd_target_profile *profile,
                              uint32_t address, const uint8_t *data) {
    struct rvswd_ch5xx_byte_access access = {
        .mode = RVSWD_CH5XX_BYTE_ACCESS_NONE,
    };

    rvswd_flash_last_error_value = 0u;
    if (profile == NULL || !profile->ch5xx_protocol || data == NULL) {
        rvswd_flash_last_error_value = 0x0fu;
        return false;
    }
    if ((address & 0xffu) != 0u) {
        rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_PAGE_UNALIGNED;
        return false;
    }

    // 官方 0x0A 路径先用命令 0x81 擦页，再独立建立命令 0x02 的整页写入状态
    if (!rvswd_flash_ch5xx_flash_enable_code_mode()) {
        rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_PAGE_ERASE_CODE_MODE;
        return false;
    }
    if (!rvswd_flash_ch5xx_flash_open(&access)) {
        rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_PAGE_ERASE_OPEN;
        return false;
    }
    if (!rvswd_flash_ch5xx_flash_erase_command(&access, address, 0x81u)) {
        return false;
    }
    // 擦页会结束前一条 Flash 命令，写页前重新写入 SAFE_ACCESS_SIG 和 code mode
    if (!rvswd_flash_ch5xx_flash_enable_code_mode()) {
        rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_CODE_MODE;
        return false;
    }
    if (!rvswd_flash_ch5xx_flash_open(&access)) {
        rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_OPEN;
        return false;
    }
    if (!rvswd_flash_ch5xx_flash_begin(&access, 0x02u) ||
        !rvswd_flash_ch5xx_flash_write_address(&access, address)) {
        rvswd_flash_last_error_value = RVSWD_FLASH_ERROR_CH5XX_PAGE_PROGRAM_BEGIN;
        return false;
    }
    if (!rvswd_flash_ch5xx_flash_program_page(&access, data)) {
        return false;
    }
    if (!rvswd_flash_ch5xx_flash_wait_ready(&access)) {
        return false;
    }
    return true;
}

static bool rvswd_flash_ch5xx_flash_erase_all(
    const struct rvswd_target_profile *profile) {
    size_t stub_length =
        (size_t)(ch5xx_flash_erase_stub_end - ch5xx_flash_erase_stub_start);
    uint32_t result;

    // RAM stub 按 LinkE 固件的 4 KiB 扇区路径完成整片擦除
    if (stub_length == 0u || stub_length > RVSWD_CH5XX_ERASE_STUB_MAX_SIZE ||
        (stub_length & 3u) != 0u) {
        rvswd_flash_last_error_value = 0xc1u;
        return false;
    }
    if (!rvswd_memory_write(profile, RVSWD_CH5XX_ERASE_STUB_ADDRESS,
                            ch5xx_flash_erase_stub_start,
                            (uint32_t)stub_length)) {
        rvswd_flash_last_error_value = 0xc2u;
        return false;
    }
    if (!rvswd_flash_ch5xx_flash_enable_code_mode()) {
        rvswd_flash_last_error_value = 0xc3u;
        return false;
    }
    if (!rvswd_debug_execute(RVSWD_CH5XX_ERASE_STUB_ADDRESS,
                             RVSWD_CH5XX_ERASE_STUB_STACK_TOP, 0u, 0u,
                             RVSWD_CH5XX_FLASH_END, 0u, &result)) {
        rvswd_flash_last_error_value = 0xc4u;
        return false;
    }
    if (result != 0u) {
        rvswd_flash_last_error_value = 0xc5u;
        return false;
    }
    return true;
}

bool rvswd_flash_erase_all(const struct rvswd_target_profile *profile) {
    uint32_t control;
    uint32_t idle_control;
    uint32_t status;
    bool unlocked;
    bool success = false;

    rvswd_flash_last_error_value = 0u;
    if (profile == NULL) {
        rvswd_flash_last_error_value = 0x0fu;
        return false;
    }
    if (profile->ch5xx_protocol) {
        return rvswd_flash_ch5xx_flash_erase_all(profile);
    }

