0wQ/ch32x035-usb-wchlink/src/wchlink/rvswd/rvswd_flash.c
    if (!rvswd_flash_wait_ready(profile, &status, 0x11u, 0x12u)) {
        return false;
    }

    if (!rvswd_memory_read32(profile, true, RVSWD_FLASH_CTLR_ADDRESS,
                             &control)) {
        rvswd_flash_last_error_value = 0x13u;
        return false;
    }

    switch (profile->erase_unlock) {
        case RVSWD_FLASH_UNLOCK_MAIN_OPTION_AND_FAST:
            unlocked = rvswd_flash_unlock_main_option_and_fast(control);
            break;
        case RVSWD_FLASH_UNLOCK_MAIN_AND_FAST:
            unlocked = rvswd_flash_unlock_main_and_fast(control);
            break;
        default:
            rvswd_flash_last_error_value = 0x0fu;
            return false;
    }
    if (!unlocked) {
        rvswd_flash_last_error_value = 0x14u;
        return false;
    }

    if (!rvswd_memory_read32(profile, true, RVSWD_FLASH_CTLR_ADDRESS,
                             &control)) {
        rvswd_flash_last_error_value = 0x15u;
        return false;
    }
    if ((control & (RVSWD_FLASH_CTLR_LOCK | RVSWD_FLASH_CTLR_FAST_LOCK)) != 0u) {
        rvswd_flash_last_error_value = 0x16u;
        return false;
    }

    idle_control = control & ~(RVSWD_FLASH_CTLR_MER | RVSWD_FLASH_CTLR_STRT);

    // 清除上一次操作遗留的完成和写保护状态，避免误判本次擦除
    if ((status & (RVSWD_FLASH_STATR_EOP | RVSWD_FLASH_STATR_WRPRTERR)) != 0u &&
        !rvswd_memory_write32(
            RVSWD_FLASH_STATR_ADDRESS,
            status & (RVSWD_FLASH_STATR_EOP | RVSWD_FLASH_STATR_WRPRTERR))) {
        rvswd_flash_last_error_value = 0x17u;
        goto cleanup;
    }

    if (!rvswd_memory_write32(RVSWD_FLASH_CTLR_ADDRESS, idle_control)) {
        rvswd_flash_last_error_value = 0x18u;
        goto cleanup;
    }
    if (!rvswd_memory_write32(RVSWD_FLASH_CTLR_ADDRESS,
                              idle_control | RVSWD_FLASH_CTLR_MER)) {
        rvswd_flash_last_error_value = 0x19u;
        goto cleanup;
    }
    if (!rvswd_memory_write32(
            RVSWD_FLASH_CTLR_ADDRESS,
            idle_control | RVSWD_FLASH_CTLR_MER | RVSWD_FLASH_CTLR_STRT)) {
        rvswd_flash_last_error_value = 0x1au;
        goto cleanup;
    }
    if (!rvswd_flash_wait_ready(profile, &status, 0x1bu, 0x1cu)) {
        goto cleanup;
    }
    if ((status & RVSWD_FLASH_STATR_WRPRTERR) != 0u) {
        rvswd_flash_last_error_value = 0x1du;
        goto cleanup;
    }
    success = true;

cleanup:
    if (!rvswd_memory_write32(RVSWD_FLASH_CTLR_ADDRESS, idle_control)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x1eu;
        }
        success = false;
    }
    return success;
}

bool rvswd_flash_read_protected(const struct rvswd_target_profile *profile,
                                bool *protected) {
    uint32_t option_status;

    rvswd_flash_last_error_value = 0u;
    if (protected == NULL) {
        rvswd_flash_last_error_value = 0x21u;
        return false;
    }
    if (profile == NULL || profile->ch5xx_protocol) {
        rvswd_flash_last_error_value = 0x22u;
        return false;
    }
    if (!rvswd_memory_read32(profile, true, RVSWD_FLASH_OBR_ADDRESS,
                             &option_status)) {
        rvswd_flash_last_error_value = 0x23u;
        return false;
    }

    *protected = (option_status & RVSWD_FLASH_OBR_READ_PROTECTED) != 0u;
    return true;
}

bool rvswd_flash_write_protected(const struct rvswd_target_profile *profile,
                                 bool *protected) {
    uint32_t write_protection;

    rvswd_flash_last_error_value = 0u;
    if (protected == NULL) {
        rvswd_flash_last_error_value = 0x24u;
        return false;
    }
    if (profile == NULL || profile->ch5xx_protocol) {
        rvswd_flash_last_error_value = 0x25u;
        return false;
    }
    if (!rvswd_memory_read32(profile, true, RVSWD_FLASH_WPR_ADDRESS,
                             &write_protection)) {
        rvswd_flash_last_error_value = 0x26u;
        return false;
    }

    *protected = write_protection != 0xffffffffu;
    return true;
}

static bool rvswd_flash_unlock_option_bytes(bool unlock_fast_mode) {
    if (!rvswd_memory_write32(RVSWD_FLASH_KEYR_ADDRESS, RVSWD_FLASH_KEY1)) {
        rvswd_flash_last_error_value = 0xa1u;
        return false;
    }
    if (!rvswd_memory_write32(RVSWD_FLASH_KEYR_ADDRESS, RVSWD_FLASH_KEY2)) {
        rvswd_flash_last_error_value = 0xa2u;
        return false;
    }
    if (unlock_fast_mode) {
        if (!rvswd_memory_write32(RVSWD_FLASH_MODEKEYR_ADDRESS,
                                  RVSWD_FLASH_KEY1)) {
            rvswd_flash_last_error_value = 0xa3u;
            return false;
        }
        if (!rvswd_memory_write32(RVSWD_FLASH_MODEKEYR_ADDRESS,
                                  RVSWD_FLASH_KEY2)) {
            rvswd_flash_last_error_value = 0xa4u;
            return false;
        }
    }
    if (!rvswd_memory_write32(RVSWD_FLASH_OBKEYR_ADDRESS,
                              RVSWD_FLASH_KEY1)) {
        rvswd_flash_last_error_value = 0xa5u;
        return false;
    }
    if (!rvswd_memory_write32(RVSWD_FLASH_OBKEYR_ADDRESS,
                              RVSWD_FLASH_KEY2)) {
        rvswd_flash_last_error_value = 0xa6u;
        return false;
    }
    return true;
}

static bool rvswd_flash_write_option_bytes_fast_buffer(
    const struct rvswd_target_profile *profile, const uint32_t *option_words) {
    uint32_t control;
    uint32_t idle_control = 0u;
    uint32_t status;
    bool success = false;

    if (!rvswd_flash_wait_ready(profile, &status, 0x31u, 0x32u) ||
        !rvswd_memory_read32(profile, true, RVSWD_FLASH_CTLR_ADDRESS,
                             &control)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x33u;
        }
        return false;
    }
    if (!rvswd_flash_unlock_option_bytes(true)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x34u;
        }
        return false;
    }
    if (!rvswd_memory_read32(profile, true, RVSWD_FLASH_CTLR_ADDRESS,
                             &control)) {
        rvswd_flash_last_error_value = 0x35u;
        return false;
    }
    if ((control & (RVSWD_FLASH_CTLR_LOCK | RVSWD_FLASH_CTLR_FAST_LOCK)) != 0u ||
        (control & RVSWD_FLASH_CTLR_OPTION_WRITE) == 0u) {
        rvswd_flash_last_error_value = 0x36u;
        return false;
    }

    idle_control = control & ~(RVSWD_FLASH_CTLR_OPTER | RVSWD_FLASH_CTLR_STRT |
                               RVSWD_FLASH_CTLR_FAST_PROGRAM |
                               RVSWD_FLASH_CTLR_BUFFER_LOAD |
                               RVSWD_FLASH_CTLR_BUFFER_RESET);

    // Option Bytes 擦除和重写必须保持完整的 16 字节镜像
    if (!rvswd_memory_write32(RVSWD_FLASH_CTLR_ADDRESS,
                              idle_control | RVSWD_FLASH_CTLR_OPTER) ||
        !rvswd_memory_write32(
            RVSWD_FLASH_CTLR_ADDRESS,
            idle_control | RVSWD_FLASH_CTLR_OPTER | RVSWD_FLASH_CTLR_STRT) ||
        !rvswd_flash_wait_ready(profile, &status, 0x36u, 0x37u)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x38u;
        }
        goto cleanup;
    }
    if ((status & RVSWD_FLASH_STATR_WRPRTERR) != 0u) {
        rvswd_flash_last_error_value = 0x39u;
        goto cleanup;
    }

