0wQ/ch32x035-usb-wchlink/src/wchlink/rvswd/rvswd_flash.c
    // 选项字擦除完成后重新解锁快速编程模式，缓冲写入不保持 OPTWRE
    if (!rvswd_memory_read32(profile, true, RVSWD_FLASH_CTLR_ADDRESS,
                             &control) ||
        !rvswd_flash_unlock_main_and_fast(control) ||
        !rvswd_memory_read32(profile, true, RVSWD_FLASH_CTLR_ADDRESS,
                             &control)) {
        rvswd_flash_last_error_value = 0x3au;
        goto cleanup;
    }
    if ((control & (RVSWD_FLASH_CTLR_LOCK | RVSWD_FLASH_CTLR_FAST_LOCK)) != 0u) {
        rvswd_flash_last_error_value = 0x3bu;
        goto cleanup;
    }

    idle_control = control & ~(RVSWD_FLASH_CTLR_OPTION_WRITE |
                               RVSWD_FLASH_CTLR_OPTER | RVSWD_FLASH_CTLR_STRT |
                               RVSWD_FLASH_CTLR_FAST_PROGRAM |
                               RVSWD_FLASH_CTLR_BUFFER_LOAD |
                               RVSWD_FLASH_CTLR_BUFFER_RESET);

    if (!rvswd_memory_write32(RVSWD_FLASH_CTLR_ADDRESS,
                              idle_control | RVSWD_FLASH_CTLR_FAST_PROGRAM) ||
        !rvswd_memory_write32(
            RVSWD_FLASH_CTLR_ADDRESS,
            idle_control | RVSWD_FLASH_CTLR_FAST_PROGRAM |
                RVSWD_FLASH_CTLR_BUFFER_RESET) ||
        !rvswd_flash_wait_ready(profile, &status, 0x3au, 0x3bu) ||
        !rvswd_memory_write32(RVSWD_FLASH_CTLR_ADDRESS, idle_control)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x3cu;
        }
        goto cleanup;
    }

    for (uint32_t index = 0u; index < RVSWD_OPTION_BYTES_WORD_COUNT; ++index) {
        if (!rvswd_memory_write32(RVSWD_FLASH_CTLR_ADDRESS,
                                  idle_control | RVSWD_FLASH_CTLR_FAST_PROGRAM) ||
            !rvswd_memory_write32(profile->option_base + index * 4u,
                                  option_words[index]) ||
            !rvswd_memory_write32(
                RVSWD_FLASH_CTLR_ADDRESS,
                idle_control | RVSWD_FLASH_CTLR_FAST_PROGRAM |
                    RVSWD_FLASH_CTLR_BUFFER_LOAD) ||
            !rvswd_flash_wait_ready(profile, &status, 0x3du, 0x3eu) ||
            !rvswd_memory_write32(RVSWD_FLASH_CTLR_ADDRESS, idle_control)) {
            if (rvswd_flash_last_error_value == 0u) {
                rvswd_flash_last_error_value = 0x3fu;
            }
            goto cleanup;
        }
    }

    if (!rvswd_memory_write32(RVSWD_FLASH_CTLR_ADDRESS,
                              idle_control | RVSWD_FLASH_CTLR_FAST_PROGRAM) ||
        !rvswd_memory_write32(RVSWD_FLASH_ADDR_ADDRESS, profile->option_base) ||
        !rvswd_memory_write32(
            RVSWD_FLASH_CTLR_ADDRESS,
            idle_control | RVSWD_FLASH_CTLR_FAST_PROGRAM | RVSWD_FLASH_CTLR_STRT) ||
        !rvswd_flash_wait_ready(profile, &status, 0x40u, 0x41u)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x42u;
        }
        goto cleanup;
    }
    if ((status & RVSWD_FLASH_STATR_WRPRTERR) != 0u) {
        rvswd_flash_last_error_value = 0x43u;
        goto cleanup;
    }
    success = true;

cleanup:
    if (!rvswd_memory_write32(
            RVSWD_FLASH_CTLR_ADDRESS,
            (idle_control & ~RVSWD_FLASH_CTLR_OPTION_WRITE) |
                RVSWD_FLASH_CTLR_LOCK | RVSWD_FLASH_CTLR_FAST_LOCK)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x44u;
        }
        success = false;
    }
    return success;
}

static bool rvswd_flash_write_option_bytes_halfword(
    const struct rvswd_target_profile *profile, const uint32_t *option_words) {
    uint32_t control;
    uint32_t idle_control = 0u;
    uint32_t status;
    bool success = false;

    if (!rvswd_flash_wait_ready(profile, &status, 0x51u, 0x52u) ||
        !rvswd_memory_read32(profile, true, RVSWD_FLASH_CTLR_ADDRESS,
                             &control)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x53u;
        }
        return false;
    }
    if (!rvswd_flash_unlock_option_bytes(true) ||
        !rvswd_memory_read32(profile, true, RVSWD_FLASH_CTLR_ADDRESS,
                             &control)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x54u;
        }
        return false;
    }
    if ((control & (RVSWD_FLASH_CTLR_LOCK | RVSWD_FLASH_CTLR_FAST_LOCK)) != 0u ||
        (control & RVSWD_FLASH_CTLR_OPTION_WRITE) == 0u) {
        rvswd_flash_last_error_value = 0x55u;
        return false;
    }

    idle_control = control & ~(RVSWD_FLASH_CTLR_OPTION_PROGRAM |
                               RVSWD_FLASH_CTLR_OPTER | RVSWD_FLASH_CTLR_STRT);

    // Option Bytes 擦除和重写必须保持完整的 16 字节镜像
    if (!rvswd_memory_write32(RVSWD_FLASH_CTLR_ADDRESS,
                              idle_control | RVSWD_FLASH_CTLR_OPTER) ||
        !rvswd_memory_write32(
            RVSWD_FLASH_CTLR_ADDRESS,
            idle_control | RVSWD_FLASH_CTLR_OPTER | RVSWD_FLASH_CTLR_STRT) ||
        !rvswd_flash_wait_ready(profile, &status, 0x56u, 0x57u)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x58u;
        }
        goto cleanup;
    }
    if ((status & RVSWD_FLASH_STATR_WRPRTERR) != 0u) {
        rvswd_flash_last_error_value = 0x59u;
        goto cleanup;
    }

    // Option Bytes 擦除后重新解锁主存储区、快速模式和 Option Bytes
    if (!rvswd_memory_read32(profile, true, RVSWD_FLASH_CTLR_ADDRESS,
                             &control) ||
        !rvswd_flash_unlock_option_bytes(true) ||
        !rvswd_memory_read32(profile, true, RVSWD_FLASH_CTLR_ADDRESS,
                             &control)) {
        rvswd_flash_last_error_value = 0x5au;
        goto cleanup;
    }
    if ((control & (RVSWD_FLASH_CTLR_LOCK | RVSWD_FLASH_CTLR_FAST_LOCK)) != 0u ||
        (control & RVSWD_FLASH_CTLR_OPTION_WRITE) == 0u) {
        rvswd_flash_last_error_value = 0x5bu;
        goto cleanup;
    }

    idle_control = control & ~(RVSWD_FLASH_CTLR_OPTION_PROGRAM |
                               RVSWD_FLASH_CTLR_OPTER | RVSWD_FLASH_CTLR_STRT);

    for (uint32_t index = 0u; index < RVSWD_OPTION_BYTES_WORD_COUNT * 2u; ++index) {
        uint16_t value = (uint16_t)(option_words[index / 2u] >>
                                    ((index & 1u) * 16u));

        if (!rvswd_memory_write32(
                RVSWD_FLASH_CTLR_ADDRESS,
                idle_control | RVSWD_FLASH_CTLR_OPTION_PROGRAM) ||
            !rvswd_memory_write16(profile->option_base + index * 2u, value,
                                  RVSWD_ABSTRACT_TIMEOUT_US) ||
            !rvswd_flash_wait_ready(profile, &status, 0x5cu, 0x5du)) {
            if (rvswd_flash_last_error_value == 0u) {
                rvswd_flash_last_error_value = 0x5eu;
            }
            goto cleanup;
        }
        if ((status & RVSWD_FLASH_STATR_WRPRTERR) != 0u) {
            rvswd_flash_last_error_value = 0x5fu;
            goto cleanup;
        }
    }
    success = true;

cleanup:
    if (!rvswd_memory_write32(
            RVSWD_FLASH_CTLR_ADDRESS,
            (idle_control & ~RVSWD_FLASH_CTLR_OPTION_WRITE) |
                RVSWD_FLASH_CTLR_LOCK | RVSWD_FLASH_CTLR_FAST_LOCK)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x60u;
        }
        success = false;
    }
    return success;
}

static bool rvswd_flash_unprotect_option_bytes(
    const struct rvswd_target_profile *profile) {
    uint32_t control;
    uint32_t idle_control = 0u;
    uint32_t status;
    bool success = false;

    if (!rvswd_flash_wait_ready(profile, &status, 0x61u, 0x62u) ||
        !rvswd_memory_read32(profile, true, RVSWD_FLASH_CTLR_ADDRESS,
                             &control)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x63u;
        }
        return false;
    }
    if (!rvswd_flash_unlock_option_bytes(true) ||
        !rvswd_memory_read32(profile, true, RVSWD_FLASH_CTLR_ADDRESS,
                             &control)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x64u;
        }
        return false;
    }
    if ((control & RVSWD_FLASH_CTLR_LOCK) != 0u ||
        (control & RVSWD_FLASH_CTLR_OPTION_WRITE) == 0u) {
        rvswd_flash_last_error_value = 0x65u;
        return false;
    }

    idle_control = control & ~(RVSWD_FLASH_CTLR_OPTION_PROGRAM |
                               RVSWD_FLASH_CTLR_OPTER | RVSWD_FLASH_CTLR_STRT);
    if (!rvswd_memory_write32(RVSWD_FLASH_CTLR_ADDRESS,
                              idle_control | RVSWD_FLASH_CTLR_OPTER) ||
        !rvswd_memory_write32(
            RVSWD_FLASH_CTLR_ADDRESS,
            idle_control | RVSWD_FLASH_CTLR_OPTER | RVSWD_FLASH_CTLR_STRT) ||
        !rvswd_flash_wait_ready(profile, &status, 0x66u, 0x67u)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x68u;
        }
        goto cleanup;
    }
    if ((status & RVSWD_FLASH_STATR_WRPRTERR) != 0u) {
        rvswd_flash_last_error_value = 0x69u;
        goto cleanup;
    }

    // 解除读保护只恢复 RDP，保留 Option Bytes 擦除后的默认状态
    if (!rvswd_memory_read32(profile, true, RVSWD_FLASH_CTLR_ADDRESS,
                             &control) ||
        !rvswd_flash_unlock_option_bytes(true) ||
        !rvswd_memory_read32(profile, true, RVSWD_FLASH_CTLR_ADDRESS,
                             &control)) {
        rvswd_flash_last_error_value = 0x6au;
        goto cleanup;
    }
    if ((control & RVSWD_FLASH_CTLR_LOCK) != 0u ||
        (control & RVSWD_FLASH_CTLR_OPTION_WRITE) == 0u) {
        rvswd_flash_last_error_value = 0x6bu;
        goto cleanup;
    }

    idle_control = control & ~(RVSWD_FLASH_CTLR_OPTION_PROGRAM |
                               RVSWD_FLASH_CTLR_OPTER | RVSWD_FLASH_CTLR_STRT);
    if (!rvswd_memory_write32(
            RVSWD_FLASH_CTLR_ADDRESS,
            idle_control | RVSWD_FLASH_CTLR_OPTION_PROGRAM)) {
        rvswd_flash_last_error_value = 0x71u;
        goto cleanup;
    }
    if (!rvswd_memory_write16(profile->option_base,
                              RVSWD_OPTION_RDP_UNPROTECTED,
                              RVSWD_FLASH_ERASE_TIMEOUT_US)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x72u;
        }
        goto cleanup;
    }
    if (!rvswd_flash_wait_ready(profile, &status, 0x6cu, 0x6du)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x73u;
        }
        goto cleanup;
    }
    if ((status & RVSWD_FLASH_STATR_WRPRTERR) != 0u) {
        rvswd_flash_last_error_value = 0x6fu;
        goto cleanup;
    }
    success = true;

cleanup:
    if (!rvswd_memory_write32(
            RVSWD_FLASH_CTLR_ADDRESS,
            (idle_control & ~RVSWD_FLASH_CTLR_OPTION_WRITE) |
                RVSWD_FLASH_CTLR_LOCK)) {
        if (rvswd_flash_last_error_value == 0u) {
            rvswd_flash_last_error_value = 0x70u;
        }
        success = false;
    }
    return success;
}

bool rvswd_flash_set_read_protected(const struct rvswd_target_profile *profile,
                                    bool protected) {
    uint32_t option_words[RVSWD_OPTION_BYTES_WORD_COUNT];
    bool current;

    if (profile == NULL || profile->ch5xx_protocol) {
        rvswd_flash_last_error_value = 0x22u;
        return false;
    }
    if (!rvswd_flash_read_protected(profile, &current)) {
        return false;
    }
    if (current == protected) {
        return true;
    }

    if (!protected && profile->option_write == RVSWD_OPTION_WRITE_FAST_BUFFER) {
        if (!rvswd_flash_unprotect_option_bytes(profile)) {
            return false;
        }
    } else {
        for (uint32_t index = 0u; index < RVSWD_OPTION_BYTES_WORD_COUNT; ++index) {
            if (!rvswd_memory_read32(profile, true,
                                     profile->option_base + index * 4u,
                                     &option_words[index])) {
                rvswd_flash_last_error_value = 0x45u;
                return false;
            }
        }

        option_words[0] = (option_words[0] & 0xffff0000u) |
                          (protected ? RVSWD_OPTION_RDP_PROTECTED
                                     : RVSWD_OPTION_RDP_UNPROTECTED);
        switch (profile->option_write) {
            case RVSWD_OPTION_WRITE_FAST_BUFFER:
                if (!rvswd_flash_write_option_bytes_fast_buffer(profile,
                                                                option_words)) {
                    return false;
                }
                break;
            case RVSWD_OPTION_WRITE_HALFWORD:
                if (!rvswd_flash_write_option_bytes_halfword(profile,
                                                             option_words)) {
                    return false;
                }
                break;
            default:
                rvswd_flash_last_error_value = 0x5fu;
                return false;
        }
    }

    // 解除读保护时目标硬件会自动整片擦除主存储区，复位后 OBR 才加载新状态
    if (!rvswd_reset_and_halt()) {
        rvswd_flash_last_error_value = 0x46u;
        return false;
    }
    if (!rvswd_flash_read_protected(profile, &current)) {
        return false;
    }
    if (current != protected) {
        rvswd_flash_last_error_value = 0x47u;
        return false;
    }
    return true;
}

uint32_t rvswd_flash_last_error(void) {
    return rvswd_flash_last_error_value;
}
